{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "model_3", "layers": [{"name": "main_input", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "main_input", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 23296, 12]}}, {"name": "conv1d_46", "class_name": "Conv1D", "inbound_nodes": [[["main_input", 0, 0, {}]]], "config": {"name": "conv1d_46", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [1], "bias_constraint": null, "kernel_size": [3], "filters": 12}}, {"name": "leaky_re_lu_51", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_46", 0, 0, {}]]], "config": {"name": "leaky_re_lu_51", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "conv1d_47", "class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_51", 0, 0, {}]]], "config": {"name": "conv1d_47", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [1], "bias_constraint": null, "kernel_size": [3], "filters": 12}}, {"name": "leaky_re_lu_52", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_47", 0, 0, {}]]], "config": {"name": "leaky_re_lu_52", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "conv1d_48", "class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_52", 0, 0, {}]]], "config": {"name": "conv1d_48", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [2], "bias_constraint": null, "kernel_size": [24], "filters": 12}}, {"name": "leaky_re_lu_53", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_48", 0, 0, {}]]], "config": {"name": "leaky_re_lu_53", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_21", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_53", 0, 0, {}]]], "config": {"name": "dropout_21", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"name": "conv1d_49", "class_name": "Conv1D", "inbound_nodes": [[["dropout_21", 0, 0, {}]]], "config": {"name": "conv1d_49", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [1], "bias_constraint": null, "kernel_size": [3], "filters": 12}}, {"name": "leaky_re_lu_54", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_49", 0, 0, {}]]], "config": {"name": "leaky_re_lu_54", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "conv1d_50", "class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_54", 0, 0, {}]]], "config": {"name": "conv1d_50", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [1], "bias_constraint": null, "kernel_size": [3], "filters": 12}}, {"name": "leaky_re_lu_55", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_50", 0, 0, {}]]], "config": {"name": "leaky_re_lu_55", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "conv1d_51", "class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_55", 0, 0, {}]]], "config": {"name": "conv1d_51", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [2], "bias_constraint": null, "kernel_size": [24], "filters": 12}}, {"name": "leaky_re_lu_56", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_51", 0, 0, {}]]], "config": {"name": "leaky_re_lu_56", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_22", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_56", 0, 0, {}]]], "config": {"name": "dropout_22", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"name": "conv1d_52", "class_name": "Conv1D", "inbound_nodes": [[["dropout_22", 0, 0, {}]]], "config": {"name": "conv1d_52", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [1], "bias_constraint": null, "kernel_size": [3], "filters": 12}}, {"name": "leaky_re_lu_57", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_52", 0, 0, {}]]], "config": {"name": "leaky_re_lu_57", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "conv1d_53", "class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_57", 0, 0, {}]]], "config": {"name": "conv1d_53", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [1], "bias_constraint": null, "kernel_size": [3], "filters": 12}}, {"name": "leaky_re_lu_58", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_53", 0, 0, {}]]], "config": {"name": "leaky_re_lu_58", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "conv1d_54", "class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_58", 0, 0, {}]]], "config": {"name": "conv1d_54", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [2], "bias_constraint": null, "kernel_size": [24], "filters": 12}}, {"name": "leaky_re_lu_59", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_54", 0, 0, {}]]], "config": {"name": "leaky_re_lu_59", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_23", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_59", 0, 0, {}]]], "config": {"name": "dropout_23", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"name": "conv1d_55", "class_name": "Conv1D", "inbound_nodes": [[["dropout_23", 0, 0, {}]]], "config": {"name": "conv1d_55", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [1], "bias_constraint": null, "kernel_size": [3], "filters": 12}}, {"name": "leaky_re_lu_60", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_55", 0, 0, {}]]], "config": {"name": "leaky_re_lu_60", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "conv1d_56", "class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_60", 0, 0, {}]]], "config": {"name": "conv1d_56", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [1], "bias_constraint": null, "kernel_size": [3], "filters": 12}}, {"name": "leaky_re_lu_61", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_56", 0, 0, {}]]], "config": {"name": "leaky_re_lu_61", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "conv1d_57", "class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_61", 0, 0, {}]]], "config": {"name": "conv1d_57", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [2], "bias_constraint": null, "kernel_size": [24], "filters": 12}}, {"name": "leaky_re_lu_62", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_57", 0, 0, {}]]], "config": {"name": "leaky_re_lu_62", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_24", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_62", 0, 0, {}]]], "config": {"name": "dropout_24", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"name": "conv1d_58", "class_name": "Conv1D", "inbound_nodes": [[["dropout_24", 0, 0, {}]]], "config": {"name": "conv1d_58", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [1], "bias_constraint": null, "kernel_size": [3], "filters": 12}}, {"name": "leaky_re_lu_63", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_58", 0, 0, {}]]], "config": {"name": "leaky_re_lu_63", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "conv1d_59", "class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_63", 0, 0, {}]]], "config": {"name": "conv1d_59", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [1], "bias_constraint": null, "kernel_size": [3], "filters": 12}}, {"name": "leaky_re_lu_64", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_59", 0, 0, {}]]], "config": {"name": "leaky_re_lu_64", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "conv1d_60", "class_name": "Conv1D", "inbound_nodes": [[["leaky_re_lu_64", 0, 0, {}]]], "config": {"name": "conv1d_60", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1], "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "strides": [2], "bias_constraint": null, "kernel_size": [48], "filters": 12}}, {"name": "leaky_re_lu_65", "class_name": "LeakyReLU", "inbound_nodes": [[["conv1d_60", 0, 0, {}]]], "config": {"name": "leaky_re_lu_65", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_25", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_65", 0, 0, {}]]], "config": {"name": "dropout_25", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"name": "bidirectional_4", "class_name": "Bidirectional", "inbound_nodes": [[["dropout_25", 0, 0, {}]]], "config": {"name": "bidirectional_4", "trainable": true, "layer": {"class_name": "CuDNNGRU", "config": {"name": "cu_dnngru_4", "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "batch_input_shape": [null, 2250, 12], "kernel_constraint": null, "stateful": false, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "dtype": "float32", "return_sequences": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "units": 12, "bias_constraint": null, "activity_regularizer": null}}, "merge_mode": "concat"}}, {"name": "leaky_re_lu_66", "class_name": "LeakyReLU", "inbound_nodes": [[["bidirectional_4", 0, 0, {}]]], "config": {"name": "leaky_re_lu_66", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_26", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_66", 0, 0, {}]]], "config": {"name": "dropout_26", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"name": "attention_with_context_3", "class_name": "AttentionWithContext", "inbound_nodes": [[["dropout_26", 0, 0, {}]]], "config": {"name": "attention_with_context_3", "trainable": true}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["attention_with_context_3", 0, 0, {}]]], "config": {"name": "batch_normalization_3", "trainable": true, "momentum": 0.99, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "leaky_re_lu_67", "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "leaky_re_lu_67", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_27", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_67", 0, 0, {}]]], "config": {"name": "dropout_27", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dropout_27", 0, 0, {}]]], "config": {"name": "dense_3", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "sigmoid", "units": 9, "bias_constraint": null}}], "input_layers": [["main_input", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}